rain-day27/S32K3_EB_Config/MCAL/BaseNXP_TS_T40D34M50I0R0/header/S32M27x_SIUL2.h
#define SIUL2_MUX1_MISC_EN_LPUART0TRG_EN_MASK    (0x100U)
#define SIUL2_MUX1_MISC_EN_LPUART0TRG_EN_SHIFT   (8U)
#define SIUL2_MUX1_MISC_EN_LPUART0TRG_EN_WIDTH   (1U)
#define SIUL2_MUX1_MISC_EN_LPUART0TRG_EN(x)      (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX1_MISC_EN_LPUART0TRG_EN_SHIFT)) & SIUL2_MUX1_MISC_EN_LPUART0TRG_EN_MASK)

#define SIUL2_MUX1_MISC_EN_LPUART1TRG_EN_MASK    (0x200U)
#define SIUL2_MUX1_MISC_EN_LPUART1TRG_EN_SHIFT   (9U)
#define SIUL2_MUX1_MISC_EN_LPUART1TRG_EN_WIDTH   (1U)
#define SIUL2_MUX1_MISC_EN_LPUART1TRG_EN(x)      (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX1_MISC_EN_LPUART1TRG_EN_SHIFT)) & SIUL2_MUX1_MISC_EN_LPUART1TRG_EN_MASK)

#define SIUL2_MUX1_MISC_EN_LPUART2TRG_EN_MASK    (0x400U)
#define SIUL2_MUX1_MISC_EN_LPUART2TRG_EN_SHIFT   (10U)
#define SIUL2_MUX1_MISC_EN_LPUART2TRG_EN_WIDTH   (1U)
#define SIUL2_MUX1_MISC_EN_LPUART2TRG_EN(x)      (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX1_MISC_EN_LPUART2TRG_EN_SHIFT)) & SIUL2_MUX1_MISC_EN_LPUART2TRG_EN_MASK)

#define SIUL2_MUX1_MISC_EN_LPUART3TRG_EN_MASK    (0x800U)
#define SIUL2_MUX1_MISC_EN_LPUART3TRG_EN_SHIFT   (11U)
#define SIUL2_MUX1_MISC_EN_LPUART3TRG_EN_WIDTH   (1U)
#define SIUL2_MUX1_MISC_EN_LPUART3TRG_EN(x)      (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX1_MISC_EN_LPUART3TRG_EN_SHIFT)) & SIUL2_MUX1_MISC_EN_LPUART3TRG_EN_MASK)

#define SIUL2_MUX1_MISC_EN_BCTUFIFO0DMA_EN_MASK  (0x10000U)
#define SIUL2_MUX1_MISC_EN_BCTUFIFO0DMA_EN_SHIFT (16U)
#define SIUL2_MUX1_MISC_EN_BCTUFIFO0DMA_EN_WIDTH (1U)
#define SIUL2_MUX1_MISC_EN_BCTUFIFO0DMA_EN(x)    (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX1_MISC_EN_BCTUFIFO0DMA_EN_SHIFT)) & SIUL2_MUX1_MISC_EN_BCTUFIFO0DMA_EN_MASK)

#define SIUL2_MUX1_MISC_EN_BCTUFIFO1DMA_EN_MASK  (0x20000U)
#define SIUL2_MUX1_MISC_EN_BCTUFIFO1DMA_EN_SHIFT (17U)
#define SIUL2_MUX1_MISC_EN_BCTUFIFO1DMA_EN_WIDTH (1U)
#define SIUL2_MUX1_MISC_EN_BCTUFIFO1DMA_EN(x)    (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX1_MISC_EN_BCTUFIFO1DMA_EN_SHIFT)) & SIUL2_MUX1_MISC_EN_BCTUFIFO1DMA_EN_MASK)

#define SIUL2_MUX1_MISC_EN_BCTUADC0DMA_EN_MASK   (0x40000U)
#define SIUL2_MUX1_MISC_EN_BCTUADC0DMA_EN_SHIFT  (18U)
#define SIUL2_MUX1_MISC_EN_BCTUADC0DMA_EN_WIDTH  (1U)
#define SIUL2_MUX1_MISC_EN_BCTUADC0DMA_EN(x)     (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX1_MISC_EN_BCTUADC0DMA_EN_SHIFT)) & SIUL2_MUX1_MISC_EN_BCTUADC0DMA_EN_MASK)

#define SIUL2_MUX1_MISC_EN_BCTUADC1DMA_EN_MASK   (0x80000U)
#define SIUL2_MUX1_MISC_EN_BCTUADC1DMA_EN_SHIFT  (19U)
#define SIUL2_MUX1_MISC_EN_BCTUADC1DMA_EN_WIDTH  (1U)
#define SIUL2_MUX1_MISC_EN_BCTUADC1DMA_EN(x)     (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX1_MISC_EN_BCTUADC1DMA_EN_SHIFT)) & SIUL2_MUX1_MISC_EN_BCTUADC1DMA_EN_MASK)

#define SIUL2_MUX1_MISC_EN_BCTUFIFO0INT_EN_MASK  (0x200000U)
#define SIUL2_MUX1_MISC_EN_BCTUFIFO0INT_EN_SHIFT (21U)
#define SIUL2_MUX1_MISC_EN_BCTUFIFO0INT_EN_WIDTH (1U)
#define SIUL2_MUX1_MISC_EN_BCTUFIFO0INT_EN(x)    (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX1_MISC_EN_BCTUFIFO0INT_EN_SHIFT)) & SIUL2_MUX1_MISC_EN_BCTUFIFO0INT_EN_MASK)

#define SIUL2_MUX1_MISC_EN_BCTUFIFO1INT_EN_MASK  (0x400000U)
#define SIUL2_MUX1_MISC_EN_BCTUFIFO1INT_EN_SHIFT (22U)
#define SIUL2_MUX1_MISC_EN_BCTUFIFO1INT_EN_WIDTH (1U)
#define SIUL2_MUX1_MISC_EN_BCTUFIFO1INT_EN(x)    (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX1_MISC_EN_BCTUFIFO1INT_EN_SHIFT)) & SIUL2_MUX1_MISC_EN_BCTUFIFO1INT_EN_MASK)

#define SIUL2_MUX1_MISC_EN_BCTULISTINT_EN_MASK   (0x800000U)
#define SIUL2_MUX1_MISC_EN_BCTULISTINT_EN_SHIFT  (23U)
#define SIUL2_MUX1_MISC_EN_BCTULISTINT_EN_WIDTH  (1U)
#define SIUL2_MUX1_MISC_EN_BCTULISTINT_EN(x)     (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX1_MISC_EN_BCTULISTINT_EN_SHIFT)) & SIUL2_MUX1_MISC_EN_BCTULISTINT_EN_MASK)

#define SIUL2_MUX1_MISC_EN_BCTUADC0INT_EN_MASK   (0x1000000U)
#define SIUL2_MUX1_MISC_EN_BCTUADC0INT_EN_SHIFT  (24U)
#define SIUL2_MUX1_MISC_EN_BCTUADC0INT_EN_WIDTH  (1U)
#define SIUL2_MUX1_MISC_EN_BCTUADC0INT_EN(x)     (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX1_MISC_EN_BCTUADC0INT_EN_SHIFT)) & SIUL2_MUX1_MISC_EN_BCTUADC0INT_EN_MASK)

#define SIUL2_MUX1_MISC_EN_BCTUADC1INT_EN_MASK   (0x2000000U)
#define SIUL2_MUX1_MISC_EN_BCTUADC1INT_EN_SHIFT  (25U)
#define SIUL2_MUX1_MISC_EN_BCTUADC1INT_EN_WIDTH  (1U)
#define SIUL2_MUX1_MISC_EN_BCTUADC1INT_EN(x)     (((uint32_t)(((uint32_t)(x)) << SIUL2_MUX1_MISC_EN_BCTUADC1INT_EN_SHIFT)) & SIUL2_MUX1_MISC_EN_BCTUADC1INT_EN_MASK)
/*! @} */

/*! @name MIDR3 - SIUL2 MCU ID Register #3 */
/*! @{ */

#define SIUL2_MIDR3_SYS_RAM_SIZE_MASK            (0x3FU)
#define SIUL2_MIDR3_SYS_RAM_SIZE_SHIFT           (0U)
#define SIUL2_MIDR3_SYS_RAM_SIZE_WIDTH           (6U)
#define SIUL2_MIDR3_SYS_RAM_SIZE(x)              (((uint32_t)(((uint32_t)(x)) << SIUL2_MIDR3_SYS_RAM_SIZE_SHIFT)) & SIUL2_MIDR3_SYS_RAM_SIZE_MASK)

#define SIUL2_MIDR3_PART_NO_SUF_MASK             (0xFC00U)
#define SIUL2_MIDR3_PART_NO_SUF_SHIFT            (10U)
#define SIUL2_MIDR3_PART_NO_SUF_WIDTH            (6U)
#define SIUL2_MIDR3_PART_NO_SUF(x)               (((uint32_t)(((uint32_t)(x)) << SIUL2_MIDR3_PART_NO_SUF_SHIFT)) & SIUL2_MIDR3_PART_NO_SUF_MASK)

#define SIUL2_MIDR3_PROD_FAM_NO_MASK             (0x3FF0000U)
#define SIUL2_MIDR3_PROD_FAM_NO_SHIFT            (16U)
#define SIUL2_MIDR3_PROD_FAM_NO_WIDTH            (10U)
#define SIUL2_MIDR3_PROD_FAM_NO(x)               (((uint32_t)(((uint32_t)(x)) << SIUL2_MIDR3_PROD_FAM_NO_SHIFT)) & SIUL2_MIDR3_PROD_FAM_NO_MASK)

#define SIUL2_MIDR3_PROD_FAM_LET_MASK            (0xFC000000U)
#define SIUL2_MIDR3_PROD_FAM_LET_SHIFT           (26U)
#define SIUL2_MIDR3_PROD_FAM_LET_WIDTH           (6U)
#define SIUL2_MIDR3_PROD_FAM_LET(x)              (((uint32_t)(((uint32_t)(x)) << SIUL2_MIDR3_PROD_FAM_LET_SHIFT)) & SIUL2_MIDR3_PROD_FAM_LET_MASK)
/*! @} */

/*! @name MIDR4 - SIUL2 MCU ID Register #4 */
/*! @{ */

#define SIUL2_MIDR4_CORE_PLAT_FET_MASK           (0x7U)
#define SIUL2_MIDR4_CORE_PLAT_FET_SHIFT          (0U)
#define SIUL2_MIDR4_CORE_PLAT_FET_WIDTH          (3U)
#define SIUL2_MIDR4_CORE_PLAT_FET(x)             (((uint32_t)(((uint32_t)(x)) << SIUL2_MIDR4_CORE_PLAT_FET_SHIFT)) & SIUL2_MIDR4_CORE_PLAT_FET_MASK)
/*! @} */

/*! @name MSCR - SIUL2 Multiplexed Signal Configuration Register */
/*! @{ */

